HCHCHC99/HBfa04a/FA04A_v.1.0.0/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
#include "dev_motor.h"
#include "App_Params.h"
#include "dev_pwm.h"          // PWM设备头文�?
#include "dev_voltage.h"      // 电压报警事件头文�?
#include "dev_sensor.h"       // 电流报警事件头文�?
#include "device_manager.h"
#include "TickTimer.h"
#include <string.h>
#include "rtt_log.h"
#include "dev_rturn.h"          // 旋转限位，包�? RTurn_LimitEvent_t
#include "Template_Pwm.h"       // PWM配置：TMRA_4, PB6/PB7�?
#include "hc32_ll_tmra.h"      // TMRA寄存器操作头文件
#include "event_recorder.h"

#if MOTOR_CONTROL_MODE == 1
#include "Pwm.h"                // PWM 斜坡控制头文�?

/* PWM 全局实例（在 main.c 中定义）*/
extern pwm_t g_motor_pwm_ch1;   // PB6
extern pwm_t g_motor_pwm_ch2;   // PB7
extern pwm_t g_motor_pwm_ch3;   // PB8
extern pwm_t g_motor_pwm_ch4;   // PB9

/* PWM 模式静态状态变�? */
static MotorDir_t s_eLastArbitrationDir = DIR_NONE;
static uint16_t s_u16LastTargetDuty = 0;
static bool s_bPolaritySwitchPending = false;   /* 极性切换等待中标志 */
static uint16_t s_u16PendingTargetDuty = 0;      /* 等待切换的最终目标占空比 */
static uint8_t s_u8PendingDirection = 0;          /* 等待切换的方�?: 1=FWD 2=REV */

/* 缓起/缓停时间（毫秒）*/
#define MOTOR_RAMP_TIME_MS      800

/* 占空比限制：2%-98% */
#define MOTOR_DUTY_MIN          2
#define MOTOR_DUTY_MAX          98

/* 占空比限幅函�? */
static uint16_t Motor_LimitDuty(uint16_t duty) {
    if (duty < MOTOR_DUTY_MIN) return MOTOR_DUTY_MIN;
    if (duty > MOTOR_DUTY_MAX) return MOTOR_DUTY_MAX;
    return duty;
}

/* 停止：PB6~PB9 �? 98% 低有�? */
static void Motor_SetStopDuty(void) {
    stc_tmra_pwm_init_t stcPwmInit;
    (void)TMRA_PWM_StructInit(&stcPwmInit);
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    uint32_t u32Compare = (u32Period * 98U) / 100U;

    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;
    stcPwmInit.u32CompareValue = u32Compare;

    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}

/* 运行极性：全部改为低有�? */
static void Motor_SetRunPolarity(void) {
    stc_tmra_pwm_init_t stcPwmInit;
    (void)TMRA_PWM_StructInit(&stcPwmInit);

    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;

    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}

/* 直接设置4通道占空比，运行态全部低有效 */
static void Motor_SetRunDutyDirect(uint16_t ch1, uint16_t ch2, uint16_t ch3, uint16_t ch4) {
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH1, (u32Period * ch1) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH2, (u32Period * ch2) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH3, (u32Period * ch3) / 100U);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH4, (u32Period * ch4) / 100U);
}

/* 斜坡-正转：CH1/2 低占空比，CH3/4 高占空比 */
static void Motor_RampForward(uint16_t target_duty) {
    uint16_t limited_duty = Motor_LimitDuty(target_duty);
    uint16_t duty_low = limited_duty;
    uint16_t duty_high = 100 - limited_duty;
    uint16_t current_duty_ch1 = PWM_GetDuty(&g_motor_pwm_ch1);

    if (current_duty_ch1 != 0) {
        /* 先归零，在等待完成后�? Motor_Update 中继续斜�? */
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 100 - current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 100 - current_duty_ch1, 0, 50);
        s_u16PendingTargetDuty = limited_duty;
        s_u8PendingDirection = 1;
        s_bPolaritySwitchPending = true;
        return;
    }

    /* 当前�?0%，直接进行极性切�? */
    Motor_SetRunPolarity();
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, duty_high, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, duty_high, MOTOR_RAMP_TIME_MS);
}

/* 斜坡-反转：CH1/2 高占空比，CH3/4 低占空比 */
static void Motor_RampReverse(uint16_t target_duty) {
    uint16_t limited_duty = Motor_LimitDuty(target_duty);
    uint16_t duty_low = 100 - limited_duty;
    uint16_t duty_high = limited_duty;
    uint16_t current_duty_ch1 = PWM_GetDuty(&g_motor_pwm_ch1);

    if (current_duty_ch1 != 0) {
        /* 先归零，在等待完成后�? Motor_Update 中继续斜�? */
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 100 - current_duty_ch1, 0, 50);
        PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 100 - current_duty_ch1, 0, 50);
        s_u16PendingTargetDuty = limited_duty;
        s_u8PendingDirection = 2;
        s_bPolaritySwitchPending = true;
        return;
    }

    /* 当前�?0%，直接进行极性切�? */
    Motor_SetRunPolarity();
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch1, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch2, 0, duty_low, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch3, 0, duty_high, MOTOR_RAMP_TIME_MS);
    PWM_StartRamp_TargetFromStart(&g_motor_pwm_ch4, 0, duty_high, MOTOR_RAMP_TIME_MS);
}

