HCHCHC99/HBfa04a/FA04A_v.1.0.0/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
/* 立即正转（无斜坡�?*/
static void Motor_RunForwardImmediate(uint16_t duty) {
    uint16_t limited_duty = Motor_LimitDuty(duty);
    uint16_t duty_low = limited_duty;
    uint16_t duty_high = 100 - limited_duty;
    Motor_SetRunPolarity();
    Motor_SetRunDutyDirect(duty_low, duty_low, duty_high, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch1, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch2, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch3, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch4, duty_high);
}

/* 立即反转（无斜坡�?*/
static void Motor_RunReverseImmediate(uint16_t duty) {
    uint16_t limited_duty = Motor_LimitDuty(duty);
    uint16_t duty_low = 100 - limited_duty;
    uint16_t duty_high = limited_duty;
    Motor_SetRunPolarity();
    Motor_SetRunDutyDirect(duty_low, duty_low, duty_high, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch1, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch2, duty_low);
    PWM_SetDuty(&g_motor_pwm_ch3, duty_high);
    PWM_SetDuty(&g_motor_pwm_ch4, duty_high);
}
#endif /* MOTOR_CONTROL_MODE == 1 */

// ========== 反转消隐变量 ==========
static uint8_t s_u8LastArbWasRev = 0;
static NonBlockingDelay_t s_stcReverseBlankTimer;
volatile uint8_t g_u8MotorReverseBlankActive = 0;

// ========== 正转消隐变量 ==========
static uint8_t s_u8LastArbWasFwd = 0;
static NonBlockingDelay_t s_stcForwardBlankTimer;
volatile uint8_t g_u8MotorForwardBlankActive = 0;

// 本文件头文件 include 之后的内�?
// 打印相关变量
volatile int motor_state = 0;
static uint32_t s_u32LastMotorPrintTime = 0;
#define MOTOR_PRINT_INTERVAL_MS   500

// ========== Keil Watch 调试全局变量 ==========
// 仲裁器内部变�? - �? Watch 窗口中可查看这些变量实时观察仲裁状�?
MotorDevice_t* volatile g_pMotor_Dev_Watch = NULL;      // 电机设备指针（展开可查看所有成员）
MotorDebugInfo_t volatile g_stcMotorDebug = {0};     // 调试信息（完整结构体形式�?
// 为了方便查看，再添加一些单独的变量
volatile uint8_t  g_u8MotorDebug_BlockFwdCount = 0;   // 正转阻塞队列数量
volatile uint8_t  g_u8MotorDebug_BlockRevCount = 0;   // 反转阻塞队列数量
volatile uint8_t  g_u8MotorDebug_AllowFwdCount = 0;   // 正转允许队列数量
volatile uint8_t  g_u8MotorDebug_AllowRevCount = 0;   // 反转允许队列数量
volatile uint8_t  g_u8MotorDebug_ActiveDeviceId = 0;  // 当前活动设备ID
volatile uint8_t  g_u8MotorDebug_ActiveDir = 0;       // 当前活动方向(0=停止,1=正转,2=反转)
volatile uint8_t  g_u8MotorDebug_State = 0;           // 电机状�?(0=IDLE,1=RAMPING,2=RUNNING)
volatile float    g_fMotorDebug_CurrentDuty = 0.0f;   // 当前占空�?
volatile uint8_t  g_u8MotorDebug_ConflictFault = 0;   // 冲突故障标志

// ========== 设备ID定义 ==========
#define DEV_PWM_MOTOR_ID    1   // 电机PWM设备ID
#define DEV_MOTOR_ID        0   // 电机设备ID，与 App_Motor_Project.h 中的 ID_MOTOR 保持一�?

// ========== 设备基因�? ==========
typedef struct {
    MotorDeviceId_t id;
    MotorPriority_t priority;
    uint32_t capability;
} MotorDeviceGene_t;

// 根据优先级模式动态设置优先级�?
#if MOTOR_PRIORITY_IO_HIGH
    #define MANUAL_PRIORITY  3
    #define CAN_PRIORITY     4
#else
    #define MANUAL_PRIORITY  4
    #define CAN_PRIORITY     3
#endif

// 设备基因�?
static const MotorDeviceGene_t c_device_genes[] = {
#if MOTOR_MODE_BIPOLAR
    { DEV_ID_POWER_POS,  PRIO_POWER,     CAP_ALLOW },
    { DEV_ID_POWER_NEG,  PRIO_POWER,     CAP_ALLOW },
#endif
    // { DEV_ID_LIMIT_FWD,  PRIO_LIMIT,     CAP_BLOCK },
    // { DEV_ID_LIMIT_REV,  PRIO_LIMIT,     CAP_BLOCK },
    { DEV_ID_RTURN_FWD,         PRIO_LIMIT,     CAP_ALLOW },
    { DEV_ID_RTURN_REV,         PRIO_LIMIT,     CAP_ALLOW },
    { DEV_ID_OVERVOLTAGE_FWD,   PRIO_LIMIT,     CAP_BLOCK },
    { DEV_ID_OVERVOLTAGE_REV,   PRIO_LIMIT,     CAP_BLOCK },
    { DEV_ID_UNDERVOLTAGE_FWD,  PRIO_LIMIT,     CAP_BLOCK },
    { DEV_ID_UNDERVOLTAGE_REV,  PRIO_LIMIT,     CAP_BLOCK },
    { DEV_ID_OVERCUR_FWD,       PRIO_LIMIT,     CAP_BLOCK },
    { DEV_ID_OVERCUR_REV,       PRIO_LIMIT,     CAP_BLOCK },
    // { DEV_ID_CAN,        (MotorPriority_t)CAN_PRIORITY,   MOTOR_CAN_CAPABILITY },
    { DEV_ID_IO_FWD,     (MotorPriority_t)MANUAL_PRIORITY, MOTOR_MANUAL_CAPABILITY },
    { DEV_ID_IO_REV,     (MotorPriority_t)MANUAL_PRIORITY, MOTOR_MANUAL_CAPABILITY },
    // { DEV_ID_EMERGENCY,  PRIO_EMERGENCY, CAP_BLOCK }
};

// ========== 仲裁回调函数（弱定义，用户可重写�?==========
// 使用 Template_Pwm.h �? APP_FUNC_FOUR_CH_LOW_PWM 模式配置�?
//   TMRA_UNIT = CM_TMRA_4, CH1=PB6, CH2=PB7, CH3=PB8, CH4=PB9
// 正转：PB6=20%, PB7=20%, PB8=80%, PB9=80%（全部低有效�?
// 反转：PB6=80%, PB7=80%, PB8=20%, PB9=20%（全部低有效�?
// 停止：PB6=50%(低有�?), PB7=50%(低有�?), PB8=50%(低有�?), PB9=50%(低有�?)

#if 0  // 已禁用：被上面PWM模块中的 Motor_SetRunDutyDirect/Motor_SetStopDuty/Motor_SetRunPolarity 替代
// 内部函数：设�? TMRA_4 四通道占空比，全部低有�?
static void Motor_SetPwmDuty(uint32_t u32Ch1Pct, uint32_t u32Ch2Pct, uint32_t u32Ch3Pct, uint32_t u32Ch4Pct) {
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH1, (u32Period * u32Ch1Pct) / 100U);  // PB6
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH2, (u32Period * u32Ch2Pct) / 100U);  // PB7
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH3, (u32Period * u32Ch3Pct) / 100U);  // PB8
    TMRA_SetCompareValue(CM_TMRA_4, TMRA_CH4, (u32Period * u32Ch4Pct) / 100U);  // PB9
}
#endif

#if 0  // 已禁用：被上面PWM模块中的 Motor_SetRunDutyDirect/Motor_SetStopDuty/Motor_SetRunPolarity 替代
// 内部函数：停止时的互补极性，PB6/PB8低有效，PB7/PB9高有�?
static void Motor_SetStopPolarity(void) {
    stc_tmra_pwm_init_t stcPwmInit;
    (void)TMRA_PWM_StructInit(&stcPwmInit);
    uint32_t u32Period = TMRA_GetPeriodValue(CM_TMRA_4);
    uint32_t u32Compare = (u32Period * 50U) / 100U;

    /* CH1(PB6) - 低有效，50% */
    stcPwmInit.u32CompareValue        = u32Compare;
    stcPwmInit.u16StartPolarity       = TMRA_PWM_LOW;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_LOW;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_HIGH;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_LOW;
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);

    /* CH2(PB7) - 高有效，50% */
    stcPwmInit.u32CompareValue        = u32Compare;
    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);

