HCHCHC99/HBfa04a/FA04A_v.1.0.0/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/Dev/dev_motor.c
    /* CH3(PB8) - 低有效，50% */
    stcPwmInit.u32CompareValue        = u32Compare;
    stcPwmInit.u16StartPolarity       = TMRA_PWM_LOW;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_LOW;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_HIGH;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_LOW;
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);

    /* CH4(PB9) - 高有效，50% */
    stcPwmInit.u32CompareValue        = u32Compare;
    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}
#endif

#if 0  // 已禁用：被上面PWM模块中的 Motor_SetRunDutyDirect/Motor_SetStopDuty/Motor_SetRunPolarity 替代
// 内部函数：运行时的低有效极性，全部低有�?
static void Motor_SetRunPolarity(void) {
    stc_tmra_pwm_init_t stcPwmInit;
    (void)TMRA_PWM_StructInit(&stcPwmInit);

    /* CH1(PB6) - 低有�? */
    stcPwmInit.u16StartPolarity       = TMRA_PWM_HIGH;
    stcPwmInit.u16StopPolarity        = TMRA_PWM_HIGH;
    stcPwmInit.u16CompareMatchPolarity = TMRA_PWM_LOW;
    stcPwmInit.u16PeriodMatchPolarity = TMRA_PWM_HIGH;
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH1, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH1, ENABLE);

    /* CH2(PB7) - 低有�? */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH2, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH2, ENABLE);

    /* CH3(PB8) - 低有�? */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH3, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH3, ENABLE);

    /* CH4(PB9) - 低有�? */
    (void)TMRA_PWM_Init(CM_TMRA_4, TMRA_CH4, &stcPwmInit);
    TMRA_PWM_OutputCmd(CM_TMRA_4, TMRA_CH4, ENABLE);
}
#endif

__weak void Motor_OnArbitrationStop(MotorDevice_t* motor) {
    (void)motor;
    s_u8LastArbWasFwd = 0;
    g_u8MotorForwardBlankActive = 0;
    s_u8LastArbWasRev = 0;
    g_u8MotorReverseBlankActive = 0;
#if MOTOR_CONTROL_MODE == 0
    // === GPIO 模式 ===
    GPIO_SET(PHU_PORT, PHU_PIN);
    GPIO_SET(PHV_PORT, PHV_PIN);

    motor_state = 0;
    EvtRec_EventStopBGated(0);   /* 过流→GPIO停转：EventB 结束 */

#elif MOTOR_CONTROL_MODE == 1
    // === PWM 模式：停止时切换到停止极�? ===
    Motor_SetStopDuty();

    s_bPolaritySwitchPending = false;
    s_eLastArbitrationDir = DIR_NONE;
    s_u16LastTargetDuty = 0;

    motor_state = 0;
#endif
}

__weak void Motor_OnArbitrationFwd(MotorDevice_t* motor, float duty) {
    (void)motor;
    if (!s_u8LastArbWasFwd) {
        nbDelay_Init(&s_stcForwardBlankTimer, MOTOR_FORWARD_BLANK_MS);
        nbDelay_Start(&s_stcForwardBlankTimer);
        g_u8MotorForwardBlankActive = 1;
    }
    s_u8LastArbWasFwd = 1;
    s_u8LastArbWasRev = 0;
    g_u8MotorReverseBlankActive = 0;
#if MOTOR_CONTROL_MODE == 0
    // === GPIO 模式 ===
    (void)duty;
    // tickTimer_DelayMs(100);
    if (g_AppParam.motor_dir != 0) {
        GPIO_SET(PHV_PORT, PHV_PIN);
        GPIO_RESET(PHU_PORT, PHU_PIN);
    } else {
        GPIO_SET(PHU_PORT, PHU_PIN);
        GPIO_RESET(PHV_PORT, PHV_PIN);
    }

    motor_state = 1;

#elif MOTOR_CONTROL_MODE == 1
    // === PWM 模式 ===
    uint16_t duty_percent = (uint16_t)(duty);

    if (s_eLastArbitrationDir != DIR_FWD || s_u16LastTargetDuty != duty_percent) {
        if (g_AppParam.motor_dir != 0) {
            Motor_RampReverse(duty_percent);
        } else {
            Motor_RampForward(duty_percent);
        }
        s_eLastArbitrationDir = DIR_FWD;
        s_u16LastTargetDuty = duty_percent;
    }
    motor_state = 1;
#endif
}

__weak void Motor_OnArbitrationRev(MotorDevice_t* motor, float duty) {
    (void)motor;
    s_u8LastArbWasFwd = 0;
    g_u8MotorForwardBlankActive = 0;
    if (!s_u8LastArbWasRev) {
        nbDelay_Init(&s_stcReverseBlankTimer, MOTOR_REVERSE_BLANK_MS);
        nbDelay_Start(&s_stcReverseBlankTimer);
        g_u8MotorReverseBlankActive = 1;
    }
    s_u8LastArbWasRev = 1;
#if MOTOR_CONTROL_MODE == 0
    // === GPIO 模式 ===
    (void)duty;
    // tickTimer_DelayMs(100);
    if (g_AppParam.motor_dir != 0) {
        GPIO_SET(PHU_PORT, PHU_PIN);
        GPIO_RESET(PHV_PORT, PHV_PIN);
    } else {
        GPIO_SET(PHV_PORT, PHV_PIN);
        GPIO_RESET(PHU_PORT, PHU_PIN);
    }

    motor_state = 2;

#elif MOTOR_CONTROL_MODE == 1
    // === PWM 模式 ===
    uint16_t duty_percent = (uint16_t)(duty);

    if (s_eLastArbitrationDir != DIR_REV || s_u16LastTargetDuty != duty_percent) {
        if (g_AppParam.motor_dir != 0) {
            Motor_RampForward(duty_percent);
        } else {
            Motor_RampReverse(duty_percent);
        }
        s_eLastArbitrationDir = DIR_REV;
        s_u16LastTargetDuty = duty_percent;
    }
    motor_state = 2;
#endif
}

// ========== 内部函数声明 ==========
static const MotorDeviceGene_t* Motor_GetGene(MotorDeviceId_t id);
static void Motor_CmdList_Remove(MotorCommandList_t* q, MotorDeviceId_t id);
static void Motor_CmdList_SetAllow(MotorCommandList_t* q, MotorCommandList_t* block_q, MotorControlCommand_t cmd);
static void Motor_CmdList_SetBlock(MotorCommandList_t* q, MotorControlCommand_t cmd);
static void Motor_ArbitrationDecision(MotorDevice_t* motor);
static void Motor_UpdateDebugInfo(MotorDevice_t* motor);

// ========== 内部函数实现 ==========

static const MotorDeviceGene_t* Motor_GetGene(MotorDeviceId_t id) {
    for(int i = 0; i < sizeof(c_device_genes)/sizeof(MotorDeviceGene_t); i++) {
        if(c_device_genes[i].id == id) return &c_device_genes[i];
    }
    return NULL;
}

static void Motor_CmdList_Remove(MotorCommandList_t* q, MotorDeviceId_t id) {
    if (id == DEV_ID_RTURN_FWD || id == DEV_ID_RTURN_REV) {
        MAIN_D("[REMOVE_DEBUG] Trying to remove id=%d from queue at 0x%p, current count=%d\r\n",
               id, q, q->count);
        // 打印当前队列位置
    }
    for (int i = 0; i < q->count; i++) {
        if (q->commands[i].device_id == id) {
            MAIN_D("[REMOVE_DEBUG] FOUND and REMOVED id=%d from queue at 0x%p\r\n", id, q);
            for (int j = i; j < q->count - 1; j++) {
                q->commands[j] = q->commands[j + 1];
            }
            q->count--;
            // 清空被移除的位置
            if (q->count < MAX_COMMANDS_PER_DIRECTION) {
                q->commands[q->count].device_id = DEV_ID_NONE;
                q->commands[q->count].priority = PRIO_NONE;
                q->commands[q->count].type = CMD_TYPE_NONE_USE;
                q->commands[q->count].param = 0.0f;
                q->commands[q->count].timestamp = 0;
            }
            // 实时更新 Keil Watch 调试变量
            if (q == &g_pMotor_Dev_Watch->block_fwd) {
                g_u8MotorDebug_BlockFwdCount = q->count;
            } else if (q == &g_pMotor_Dev_Watch->block_rev) {
                g_u8MotorDebug_BlockRevCount = q->count;
            } else if (q == &g_pMotor_Dev_Watch->allow_fwd) {
                g_u8MotorDebug_AllowFwdCount = q->count;
            } else if (q == &g_pMotor_Dev_Watch->allow_rev) {
                g_u8MotorDebug_AllowRevCount = q->count;
            }
            return;
        }
    }
}

static void Motor_CmdList_SetAllow(MotorCommandList_t* q, MotorCommandList_t* block_q, MotorControlCommand_t cmd) {
    // 安全检�?: block非空则拒绝allow写入
    if (block_q != NULL && block_q->count > 0) {
        MAIN_D("[SET_ALLOW] rejected: block_q count=%d, dev_id=%d\r\n", block_q->count, cmd.device_id);
        return;
    }
    Motor_CmdList_Remove(q, cmd.device_id);
    if (q->count >= MAX_COMMANDS_PER_DIRECTION) return;

